Revit 2024 API
ElectricalSetting.AddWireMaterialType Method
 Add a new type of wire material.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public WireMaterialType AddWireMaterialType(
	string name,
	WireMaterialType baseMaterial
)
Visual Basic
Public Function AddWireMaterialType ( _
	name As String, _
	baseMaterial As WireMaterialType _
) As WireMaterialType
Visual C++
public:
WireMaterialType^ AddWireMaterialType(
	String^ name,
	WireMaterialType^ baseMaterial
)
Parameters
name
Type: System.String
Name of new material type.
baseMaterial
Type: Autodesk.Revit.DB.Electrical.WireMaterialType
Specify an existing material type which New material will be constructed based on.
Return Value
New added wire material type object.
See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace